In [11]:
import cx_Oracle
dsn = cx_Oracle.makedsn('localhost', 1521, 'orcljm')
db = cx_Oracle.connect('system', '1234', dsn)

sql = '''
    select * from emp
'''

In [12]:
import pandas as pd
data = pd.read_sql(sql, con=db)
data.head()

   EMPNO  ENAME       JOB     MGR   HIREDATE     SAL   COMM  DEPTNO
0   9999   TEMP      None     NaN        NaT     1.0    NaN     NaN
1   7369  SMITH     CLERK  7902.0 1980-12-17   800.0    NaN    20.0
2   7499  ALLEN  SALESMAN  7698.0 1981-02-20  1600.0  300.0    30.0
3   7521   WARD  SALESMAN  7698.0 1981-02-22  1250.0  500.0    30.0
4   7566  JONES   MANAGER  7839.0 1981-04-02  2975.0    NaN    20.0

In [13]:
data.dropna(subset=['HIREDATE'], inplace = True)

In [14]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 14 entries, 1 to 14
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   EMPNO     14 non-null     int64
 1   ENAME     14 non-null     object
 2   JOB       14 non-null     object
 3   MGR       13 non-null     float64
 4   HIREDATE  14 non-null     datetime64[ns]
 5   SAL       14 non-null     float64
 6   COMM      4 non-null      float64
 7   DEPTNO    14 non-null     float64
dtypes: datetime64[ns](1), float64(4), int64(1), object(2)
memory usage: 1008.0+ bytes

In [15]:
data['HIREDATE'] = data['HIREDATE'].astype(str)

In [16]:
data.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 14 entries, 1 to 14
Data columns (total 8 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   EMPNO     14 non-null     int64
 1   ENAME     14 non-null     object
 2   JOB       14 non-null     object
 3   MGR       13 non-null     float64
 4   HIREDATE  14 non-null     object
 5   SAL       14 non-null     float64
 6   COMM      4 non-null      float64
 7   DEPTNO    14 non-null     float64
dtypes: float64(4), int64(1), object(3)
memory usage: 1008.0+ bytes

In [17]:
data['YEAR'] = data['HIREDATE'].apply( lambda data: data.split('-')[0] )
data['MONTH'] = data['HIREDATE'].apply( lambda data: data.split('-')[1] )
data['DAY'] = data['HIREDATE'].apply( lambda data: data.split('-')[2] )

In [19]:
data.head(2)

,EMPNO,ENAME,JOB,MGR,HIREDATE,SAL,COMM,DEPTNO,YEAR,MONTH,DAY
1,7369,SMITH,CLERK,7902.0,1980-12-17,800.0,NaN,20.0,1980,12,17
2,7499,ALLEN,SALESMAN,7698.0,1981-02-20,1600.0,300.0,30.0,1981,02,20